Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb.main is tainted, so must be replaced
-/+ resource "aws_alb" "main" {
      ~ arn                        = "arn:aws:elasticloadbalancing:us-west-2:713516755744:loadbalancer/app/tf-ecs-chat/0236befb9d7b0df7" -> (known after apply)
      ~ arn_suffix                 = "app/tf-ecs-chat/0236befb9d7b0df7" -> (known after apply)
      ~ dns_name                   = "tf-ecs-chat-1896768326.us-west-2.elb.amazonaws.com" -> (known after apply)
        enable_deletion_protection = false
        enable_http2               = true
      ~ id                         = "arn:aws:elasticloadbalancing:us-west-2:713516755744:loadbalancer/app/tf-ecs-chat/0236befb9d7b0df7" -> (known after apply)
        idle_timeout               = 60
      ~ internal                   = false -> (known after apply)
      ~ ip_address_type            = "ipv4" -> (known after apply)
        load_balancer_type         = "application"
        name                       = "tf-ecs-chat"
        security_groups            = [
            "sg-028d4bdb7dd77ebe9",
        ]
        subnets                    = [
            "subnet-07253d534f7b9df3f",
            "subnet-0c6e9609274b0d20c",
        ]
      - tags                       = {} -> null
      ~ vpc_id                     = "vpc-00c3a227faae2de5c" -> (known after apply)
      ~ zone_id                    = "Z1H1FL5HABSF5" -> (known after apply)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-07253d534f7b9df3f" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0c6e9609274b0d20c" -> null
        }
      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # aws_alb_listener.front_end will be created
+ resource "aws_alb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_target_group.app is tainted, so must be replaced
-/+ resource "aws_alb_target_group" "app" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-west-2:713516755744:targetgroup/tf-ecs-chat/fc12c9e8f66d1ce8" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/tf-ecs-chat/fc12c9e8f66d1ce8" -> (known after apply)
        deregistration_delay               = 300
      ~ id                                 = "arn:aws:elasticloadbalancing:us-west-2:713516755744:targetgroup/tf-ecs-chat/fc12c9e8f66d1ce8" -> (known after apply)
        lambda_multi_value_headers_enabled = false
        name                               = "tf-ecs-chat"
        port                               = 80
        protocol                           = "HTTP"
        proxy_protocol_v2                  = false
        slow_start                         = 0
      - tags                               = {} -> null
        target_type                        = "ip"
        vpc_id                             = "vpc-00c3a227faae2de5c"

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # aws_ecs_service.main will be created
+ resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:us-west-2:713516755744:cluster/tf-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "tf-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + load_balancer {
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ed34fb2bb84258dd",
            ]
          + subnets          = [
              + "subnet-054d838405e365bb3",
              + "subnet-09adf32bc6f06afd4",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # aws_ecs_task_definition.app will be created
+ resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + image        = "scottyc/web-app:latest"
                  + memory       = 256
                  + name         = "app"
                  + networkMode  = "awsvpc"
                  + portMappings = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + family                   = "app"
      + id                       = (known after apply)
      + memory                   = "256"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
    }

  # aws_eip.gw[0] will be created
+ resource "aws_eip" "gw" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + vpc               = true
    }

  # aws_eip.gw[1] will be created
+ resource "aws_eip" "gw" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + vpc               = true
    }

  # aws_nat_gateway.gw[0] will be created
+ resource "aws_nat_gateway" "gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0c6e9609274b0d20c"
    }

  # aws_nat_gateway.gw[1] will be created
+ resource "aws_nat_gateway" "gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-07253d534f7b9df3f"
    }

  # aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = ""
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = (known after apply)
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + vpc_id           = "vpc-00c3a227faae2de5c"
    }

  # aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = ""
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = (known after apply)
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + vpc_id           = "vpc-00c3a227faae2de5c"
    }

  # aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-09adf32bc6f06afd4"
    }

  # aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-054d838405e365bb3"
    }

  # aws_security_group.ecs_tasks will be updated in-place
~ resource "aws_security_group" "ecs_tasks" {
        arn                    = "arn:aws:ec2:us-west-2:713516755744:security-group/sg-0ed34fb2bb84258dd"
        description            = "allow inbound access from the ALB only"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
        id                     = "sg-0ed34fb2bb84258dd"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-028d4bdb7dd77ebe9",
                ]
              + self             = false
              + to_port          = 3000
            },
        ]
        name                   = "tf-ecs-tasks"
        owner_id               = "713516755744"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-00c3a227faae2de5c"
    }

Plan: 13 to add, 1 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://62b9bdf71af7:4141/lock?id=davejrt%252Fterraform-fargate-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
